applications/test/coupledFvPatch/testMatching/AMI/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)


    (1.0 0 0)
    (1.5 0 0)
    (1.5 1 0)
    (1.0 1 0)
    (1.0 0 1)
    (1.5 0 1)
    (1.5 1 1)
    (1.0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 3 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (1 3 1) simpleGrading (1 1 1)
);

edges
(
);


defaultPatch
{
    name frontAndBack;
    type empty;
}


boundary
(
    left1
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    right1
    {
        type            cyclic;
        neighbourPatch  left2;
        faces
        (
            (2 6 5 1)
        );
    }
    walls1
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }

    left2
    {
        type            cyclic;
        neighbourPatch  right1;
        faces
        (
            (8 12 15 11)
        );
    }
    right2
    {
        type patch;
        faces
        (
            (10 14 13 9)
        );
    }
    walls2
    {
        type patch;
        faces
        (
            (11 15 14 10)
            (9 13 12 8)
        );
    }
);


// ************************************************************************* //
