applications/test/coupledFvPatch/testMatching/AMI/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication topoSet

runApplication removeFaces f0 -overwrite

runApplication -s 2 topoSet

runApplication subsetMesh -patch walls2 c1 -overwrite

runApplication createPatch -overwrite


rm -rf 0 && cp -rf 0.orig 0

runApplication icoFoam

#------------------------------------------------------------------------------
